In [1]:
# 数据导入
import pandas as pd
df=pd.read_csv('data/employees.csv')
df

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,AD_PRES,24000.0,NaN,NaN,90.0
1,101,N_ann,Kochhar,NKOCHHAR,515.123.4568,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,IT_PROG,6000.0,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,MK_REP,6000.0,NaN,201.0,20.0
103,203,Susan,Mavris,SMAVRIS,515.123.7777,HR_REP,6500.0,NaN,101.0,40.0
104,204,Hermann,Baer,HBAER,515.123.8888,PR_REP,10000.0,NaN,101.0,70.0
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,AC_MGR,12000.0,NaN,101.0,110.0
106,206,William,Gietz,WGIETZ,515.123.8181,AC_ACCOUNT,8300.0,NaN,205.0,110.0

In [2]:
# 数据的导出
df=df.head() 
df.to_csv('data/new.csv')

In [3]:
# json数据的导入
df=pd.read_json('data/data1.json') # 读取较简单的数据
print(type(df))
print('='*20)


import json
with open('data/test.json') as f:
    data=json.load(f)
print(data['users'])
print('='*20)


print(type(data))
print('='*20)


df=pd.DataFrame(data['users'])
df

<class 'pandas.core.frame.DataFrame'>
====================
[{'id': 1, 'name': '张三', 'age': 28, 'email': 'zhangsan@example.com', 'is_active': True, 'join_date': '2022-03-15'}, {'id': 2, 'name': '李四', 'age': 35, 'email': 'lisi@example.com', 'is_active': False, 'join_date': '2021-11-02'}, {'id': 3, 'name': '王五', 'age': 24, 'email': 'wangwu@example.com', 'is_active': True, 'join_date': '2023-01-20'}]
====================
<class 'dict'>
====================

   id name  age                 email  is_active   join_date
0   1   张三   28  zhangsan@example.com       True  2022-03-15
1   2   李四   35      lisi@example.com      False  2021-11-02
2   3   王五   24    wangwu@example.com       True  2023-01-20

In [4]:
# 缺失值的处理
import numpy as np
import pandas as pd
s=pd.Series([1,2,np.nan,None,pd.NA])
df=pd.DataFrame([[1,pd.NA,2],[2,3,5],[None,4,6]])
print(s)
print('='*20)


# 查看是否是缺失值
print(s.isna()) # isna()
print('='*20)
print(s.isnull()) # isnull()
print('='*20)
print('缺失值个数：',s.isna().sum())
print('='*20)
print(df.isna()) # 与series一致
print('='*20)
print(df.isna().sum())


#

0       1
1       2
2     NaN
3    None
4    <NA>
dtype: object
====================
0    False
1    False
2     True
3     True
4     True
dtype: bool
====================
0    False
1    False
2     True
3     True
4     True
dtype: bool
====================
缺失值个数： 3
====================
       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False
====================
0    1
1    1
2    0
dtype: int64

In [5]:
# 剔除缺失值
print(s.dropna()) # 只剔除缺失值 Series
print('='*20)
print(df.dropna()) # 若有缺失值，直接删除整条数据 DataFrame
print('='*20)
print(df.dropna(how='all')) # 如果所有的值都为缺失值，删除这一行
print('='*20)
print(df.dropna(thresh=2)) # 与参数how不同，在dropna()方法中是看缺失值，而thresh是看有效值。比如thresh=2，只要有效值大于等于这个数，保留数据。相反则删除。同时参数 how 和 thresh 两者不能共存

0    1
1    2
dtype: object
====================
     0  1  2
1  2.0  3  5
====================
     0     1  2
0  1.0  <NA>  2
1  2.0     3  5
2  NaN     4  6
====================
     0     1  2
0  1.0  <NA>  2
1  2.0     3  5
2  NaN     4  6

In [6]:
# 填充缺失值
df=pd.read_csv('data/weather_withna.csv')
df.tail()
print(df.isna().sum()) # 找出缺失值总数
print('='*20)


print(df.fillna({'temp_max':25,'temp_min':16,'wind':4}).tail()) # 使用字典填充 # fillna()
print('='*20)


print(df.fillna(df[['wind','temp_max','temp_min']].mean()).tail()) # 使用统计值填充 # fillna()
print('='*20)


print(df.ffill()) # 前向填充(forward fill) df.ffill() 会将缺失值用前一个非缺失值填充，沿着列方向（默认）进行。
print('='*20)


print(df.bfill()) # 后向填充(backward fill) df.bfill() 用下一个非缺失值把 NaN 填掉，默认沿着列方向（axis=0）进行。
print('='*20)

date               0
precipitation    303
temp_max         303
temp_min         303
wind             303
weather          303
dtype: int64
====================
            date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27            NaN      25.0      16.0   4.0     NaN
1457  2015-12-28            NaN      25.0      16.0   4.0     NaN
1458  2015-12-29            NaN      25.0      16.0   4.0     NaN
1459  2015-12-30            NaN      25.0      16.0   4.0     NaN
1460  2015-12-31           20.6      12.2       5.0   3.8    rain
====================
            date  precipitation   temp_max  temp_min      wind weather
1456  2015-12-27            NaN  15.851468  7.877202  3.242055     NaN
1457  2015-12-28            NaN  15.851468  7.877202  3.242055     NaN
1458  2015-12-29            NaN  15.851468  7.877202  3.242055     NaN
1459  2015-12-30            NaN  15.851468  7.877202  3.242055     NaN
1460  2015-12-31           20.6  12.200000  5.000000  3.800000    rain
====================
            date  precipitation  temp_max  temp_min  wind  weather
0     2012-01-01            0.0      12.8       5.0   4.7  drizzle
1     2012-01-02           10.9      10.6       2.8   4.5     rain
2     2012-01-03            0.8      11.7       7.2   2.3     rain
3     2012-01-04           20.3      12.2       5.6   4.7     rain
4     2012-01-05            1.3       8.9       2.8   6.1     rain
...          ...            ...       ...       ...   ...      ...
1456  2015-12-27            0.0      11.1       4.4   4.8      sun
1457  2015-12-28            0.0      11.1       4.4   4.8      sun
1458  2015-12-29            0.0      11.1       4.4   4.8      sun
1459  2015-12-30            0.0      11.1       4.4   4.8      sun
1460  2015-12-31           20.6      12.2       5.0   3.8     rain

[1461 rows x 6 columns]
====================
            date  precipitation  temp_max  temp_min  wind  weather
0     2012-01-01            0.0      12.8       5.0   4.7  drizzle
1     2012-01-02           10.9      10.6       2.8   4.5     rain
2     2012-01-03            0.8      11.7       7.2   2.3     rain
3     2012-01-04           20.3      12.2       5.6   4.7     rain
4     2012-01-05            1.3       8.9       2.8   6.1     rain
...          ...            ...       ...       ...   ...      ...
1456  2015-12-27           20.6      12.2       5.0   3.8     rain
1457  2015-12-28           20.6      12.2       5.0   3.8     rain
1458  2015-12-29           20.6      12.2       5.0   3.8     rain
1459  2015-12-30           20.6      12.2       5.0   3.8     rain
1460  2015-12-31           20.6      12.2       5.0   3.8     rain

[1461 rows x 6 columns]
====================

In [7]:
# 数据类型转换 去除重复行
import pandas as pd
data={
    'name':['alice','alice','bob','alice','jack','bob'],
    'age':[26,25,30,25,35,30],
    'city':['NY','NY','LA','NY','SF','LA']
}
df=pd.DataFrame(data)
df

    name  age city
0  alice   26   NY
1  alice   25   NY
2    bob   30   LA
3  alice   25   NY
4   jack   35   SF
5    bob   30   LA

In [8]:
df.duplicated() # 检测重复行
df.drop_duplicates(subset='name') # 去除指定的重复行
df.drop_duplicates(subset='name',keep='last') # 去除指定的重复行，并保留最新的重复数据

    name  age city
3  alice   25   NY
4   jack   35   SF
5    bob   30   LA

In [9]:
# 数据类型的转换
df=pd.read_csv('data/sleep.csv')
df.dtypes

person_id                    int64
gender                      object
age                          int64
occupation                  object
sleep_duration             float64
sleep_quality              float64
physical_activity_level      int64
stress_level                 int64
bmi_category                object
blood_pressure              object
heart_rate                   int64
daily_steps                  int64
sleep_disorder              object
dtype: object

In [10]:
df['age']=df['age'].astype('int16') # astype
df['age'].dtypes

dtype('int16')

In [11]:
df=df.astype({'age':'int16','gender':'category'}) # 一次性多次修改
df.dtypes

person_id                     int64
gender                     category
age                           int16
occupation                   object
sleep_duration              float64
sleep_quality               float64
physical_activity_level       int64
stress_level                  int64
bmi_category                 object
blood_pressure               object
heart_rate                    int64
daily_steps                   int64
sleep_disorder               object
dtype: object

In [12]:
df['is_male']=df['gender'].map({'Male':True,'Female':False})
df.is_male.head()

0     True
1    False
2     True
3     True
4     True
Name: is_male, dtype: category
Categories (2, bool): [False, True]

## 数据变形

In [ ]:
data={
    'ID':[1,2],
    'name':['alice','bob'],
    'Math':[98,85],
    'English':[88,92],
    'Science':[95,89]
}
df=pd.DataFrame(data)
df.T # 行列转置

             0    1
ID           1    2
name     alice  bob
Math        98   85
English     88   92
Science     95   89

In [14]:
# 宽表转化为长表
df2=pd.melt(df,id_vars=['ID','name'],var_name='科目',value_name='分数')
df2.sort_values('name')

   ID   name       科目  分数
0   1  alice     Math  98
2   1  alice  English  88
4   1  alice  Science  95
1   2    bob     Math  85
3   2    bob  English  92
5   2    bob  Science  89

In [15]:
# 长表转宽表
pd.pivot(df2,index=['ID','name'],columns='科目',values='分数')

科目        English  Math  Science
ID name
1  alice       88    98       95
2  bob         92    85       89

In [18]:
data={
    'ID':[1,2],
    'name':['alice smith','bob smith'],
    'Math':[98,85],
    'English':[88,92],
    'Science':[95,89]
}
df=pd.DataFrame(data)
df

   ID         name  Math  English  Science
0   1  alice smith    98       88       95
1   2    bob smith    85       92       89

In [ ]:
# 分列操作
df[['first','last']]=df['name'].str.split(' ',expand=True) # 把要处理的数据当成字符串处理 使用str
df

   ID         name  Math  English  Science  first   last
0   1  alice smith    98       88       95  alice  smith
1   2    bob smith    85       92       89    bob  smith

In [52]:
df=pd.read_csv('data/sleep.csv')
df=df[['person_id','blood_pressure']]
df[['highest','lowest']]=df['blood_pressure'].str.split('/',expand=True)
df['highest']=df['highest'].astype('int64')
df['lowest']=df['lowest'].astype('int64')
df[['highest','lowest']].dtypes # 若有多个值，使用DataFrame格式

highest    int64
lowest     int64
dtype: object

In [61]:
df.highest.mean()

np.float64(122.19)

## 数据分箱 pd.cut(x,bins,labels)

In [68]:
import pandas as pd
df=pd.read_csv('data/employees.csv')
df.head(10)

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,AD_PRES,24000.0,NaN,NaN,90.0
1,101,N_ann,Kochhar,NKOCHHAR,515.123.4568,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,IT_PROG,6000.0,NaN,103.0,60.0
5,105,David,Austin,DAUSTIN,590.423.4569,IT_PROG,4800.0,NaN,103.0,60.0
6,106,Valli,Pataballa,VPATABAL,590.423.4560,IT_PROG,4800.0,NaN,103.0,60.0
7,107,Diana,Lorentz,DLORENTZ,590.423.5567,IT_PROG,4200.0,NaN,103.0,60.0
8,108,Nancy,Greenberg,NGREENBE,515.124.4569,FI_MGR,12000.0,NaN,101.0,100.0
9,109,Daniel,Faviet,DFAVIET,515.124.4169,FI_ACCOUNT,9000.0,NaN,108.0,100.0

In [71]:
df1=df.head(10)[['employee_id','salary']]
pd.cut(df1['salary'],bins=2) # bins 自动等宽分 起始值，结束值分别时所有值的最小值和最大值
pd.cut(df1['salary'],bins=3).value_counts()

salary
(4180.2, 10800.0]     6
(10800.0, 17400.0]    3
(17400.0, 24000.0]    1
Name: count, dtype: int64

In [83]:
pd.cut(df1['salary'],bins=[0,10000,20000,30000]) # bins用列表自定义分割

0    (20000, 30000]
1    (10000, 20000]
2    (10000, 20000]
3        (0, 10000]
4        (0, 10000]
5        (0, 10000]
6        (0, 10000]
7        (0, 10000]
8    (10000, 20000]
9        (0, 10000]
Name: salary, dtype: category
Categories (3, interval[int64, right]): [(0, 10000] < (10000, 20000] < (20000, 30000]]

In [85]:
pd.cut(df1['salary'],bins=[0,10000,20000,30000]).value_counts()

salary
(0, 10000]        6
(10000, 20000]    3
(20000, 30000]    1
Name: count, dtype: int64

In [92]:
df1['收入水平']=pd.cut(df1['salary'],
                   bins=[0,10000,20000,30000],
                   labels=['低','中','高'])
df1

   employee_id   salary 收入水平
0          100  24000.0    高
1          101  17000.0    中
2          102  17000.0    中
3          103   9000.0    低
4          104   6000.0    低
5          105   4800.0    低
6          106   4800.0    低
7          107   4200.0    低
8          108  12000.0    中
9          109   9000.0    低

In [97]:
pd.qcut(df1['salary'],3).value_counts() # 等频或分位数划分

salary
(12000.0, 24000.0]    4
(4199.999, 6000.0]    3
(6000.0, 12000.0]     3
Name: count, dtype: int64

In [100]:
# 睡眠数据
df=pd.read_csv('data/sleep.csv')
df.head(10)

,person_id,gender,age,occupation,sleep_duration,sleep_quality,physical_activity_level,stress_level,bmi_category,blood_pressure,heart_rate,daily_steps,sleep_disorder
0,1,Male,29,Manual Labor,7.4,7.0,41,7,Obese,124/70,91,8539,NaN
1,2,Female,43,Retired,4.2,4.9,41,5,Obese,131/86,81,18754,NaN
2,3,Male,44,Retired,6.1,6.0,107,4,Underweight,122/70,81,2857,NaN
3,4,Male,29,Office Worker,8.3,10.0,20,10,Obese,124/72,55,6886,NaN
4,5,Male,67,Retired,9.1,9.5,19,4,Overweight,133/78,97,14945,Insomnia
5,6,Female,47,Student,6.1,6.9,24,4,Normal,123/60,87,9485,NaN
6,7,Male,22,Office Worker,5.1,6.1,26,6,Obese,121/70,66,15680,NaN
7,8,Male,49,Office Worker,10.7,6.2,49,8,Obese,134/87,59,18767,NaN
8,9,Male,25,Manual Labor,11.9,7.2,27,8,Underweight,112/63,99,16397,Sleep Apnea
9,10,Female,51,Retired,8.2,4.0,64,5,Overweight,125/84,76,12744,NaN

In [ ]:
df1=df.head(10)[['person_id','sleep_quality']]
df1['睡眠质量']=pd.cut(df1['sleep_quality'],
           bins=3,
           labels=['差','良','优'])

df1['睡眠质量'].value_counts()

睡眠质量
良    5
差    3
优    2
Name: count, dtype: int64

In [ ]:
# df.rename() df.set_index() df.reset_index()
df=pd.DataFrame({
    'name':['xx','jk','qq','jj','kk'],
    'age':[20,23,25,23,24],
    'gender':['male','female','male','male','female']
})
df.set_index('name',inplace=True) # 设置索引 inplace=True 修改原数据
df.reset_index(inplace=True)
df.rename(columns={'age':'年龄'},index={0:9})

             age
count   5.000000
mean   23.000000
std     1.870829
min    20.000000
25%    23.000000
50%    23.000000
75%    24.000000
max    25.000000